import React from "react";
    import '../../styles/basics.css'
import bg_basics_heroes from '../../assets/bg_basics_heroes.png'
import bg_basics_items from '../../assets/bg_basics_items.png'
import bg_basics_lines from '../../assets/bg_basics_lines.png'

const Basics = () => {
    return (
        <section className='basics'>
            <div className="section_heroes">
                <div className='basics_text heroes'>
                    <div>
                        <label>ОСНОВИ</label>
                        <h1>ГЕРОЇ</h1>
                    </div>
                    <p>
                        Гравці вибирають героїв на початку матчу. У Dota 2 є 124 герої, кожен з власним унікальним набором здібностей та стилем гри.
                    </p>
                    <p>
                        Існуе три основні категорії героїв:сила, спритність та інтелект.
                    </p>
                    <p>
                        Герої також поділяються на дальніх і ближніх, відповідно до типу Їхньої атаки. Героям ближнього бою треба знаходитися біля цілі, а герої дальнього бою можуть атакавати на відствані.
                    </p>
                    <p>
                        Герої мають три базові здібності та одну потужну ультимативну, яка розблокується на 6-му рівні.
                    </p>

                </div>
                <img src={bg_basics_heroes} alt="Image" />
            </div>
            <div className="section_items">
                <div className='basics_text items'>
                    <div>
                        <label>ОСНОВЫ</label>
                        <h1>ПРЕДМЕТИ</h1>
                    </div>
                    <p>
                        Герої можуть споряджати предмети, які додають і посилюють Їхні характеристики та здібності. Таким чином предмети можуть змінити стиль гри героя.
                    </p>
                    <p>
                        Предмети можна купити за золото в Крамаря, розташованого на Фонтані кожної команди.
                        Деякі предмети можна споживати, щоби відновити здоров'я героя та ману.
                    </p>
                    <p>
                        Безліч могутніх предметів можна придбати лише у двох таємних крамницях, що розташовані вглибині мапи.
                    </p>
                    <p>
                        Часто предмети, які ви купуєте, можуть бути компонентами рецептів, які у свою чергу можуть складатися в потужний предмет.
                        Покращені предмети можна також продати назад у Крамницю за половину своєї ціни.
                    </p>

                </div>
                <img src={bg_basics_items} alt="Image" />
            </div>
            <div className="section_lines">
                <div className='basics_text lines'>
                    <div>
                        <label>ОСНОВЫ</label>
                        <h1>ЛІНІЇ, КРІПИ ТА ВЕЖІ</h1>
                    </div>
                    <p>
                        База кожної команди має три набори казарм, звідки виходять хвилі кріпів, що марширують мапою до бази ворожої команди. Шляхи руху цих кріпів називаються лініями.
                    </p>
                    <p>
                        Герої заробляють досвід за вбивство кріпів, а також золото, якщо завдають останній вбивчій удар.
                    </p>
                    <p>
                        На кожній лінії з певним інтервалом розташовані три потужні вежі, які автоматично атакують ворожих героїв та крипів, що наближаються до них.
                    </p>
                    <p>
                        Окрім кріпів, що рухаються лініями, у різних місцях на мапі існують табори нейтральних крипів, яких також можно вбивати задля золота, досвіду та спеціальних предметів.
                    </p>

                </div>
                <img src={bg_basics_lines} alt="Image" />
            </div>
        </section>
    );
}
export default Basics;