import React from "react";
import '../../styles/mechanics.css'
import scroll from '../../functions/scroll'
import {useParams} from "react-router-dom";

// надо импортонуть функцию скролл, вытащить параметр из ссылки в переменную и
//  на секции навесить айди такоеже как параметр ссылки
// пример в базикс.тсх

const Mechanics = () => {

    const {'*': value} = useParams();
    console.log(value)

    scroll(value)
    return (
        <section className='mechanics'>
            <div className='section-LVL' id="sUnitLVL">
                <div className='basics_text-LVL'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>РІВЕНЬ ІСТОТИ</h2>
                    </div>
                    <div>
                        <p>
                            Герої починають гру з першим рівнем та підвищують його, отримуючи досвідза вбивство кріпів чи
                            героїв. Максимальний рівень - 30. Рівень найпростіший показник того, що один герой сильніший
                            іншого.
                        </p>
                        <p>
                            Кожен рівень дає вам очки здібностей, які можна витратити на нову здібність, покращити вже
                            вивчену чи підвищити характеристики героя. Після досягнення 10-го рівня ви також можете вивчати
                            таланти.
                        </p>
                        <p>
                            Сила, інтелект і спритність героя також зростають із кожним його рівнем. Деякі герої мають більший
                            приріст характеристик, ніж інші, що робить їх сильнішими на пізніх стадіях гри.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-GoldBountie' id="GoldBounties">
                <div className='basics_text-GoldBountie'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Золото й винагороди</h2>
                    </div>
                    <div>
                        <p>
                            Ви отримуєте золото, коли задаете вбивчого удару кріпу.
                        </p>
                        <p>
                            Ви також пассивно отримуєте золото протягом усього часу гри.
                        </p>
                        <p>
                            Винагарода золотом отримується за вбивство ворожих героїв чи за підтримку вашим союзникам у вбивстві.
                        </p>
                        <p>
                            Вороги, які сдійснили серію вбивств (певну кількість убивств без власної загибелі), дають додаткову винагороду золотом, пропорційну до серії вбивств.
                        </p>
                        <p>
                            Руни достатку відроджуються щотрихвилини в кожному лісі й винагороджують усю команду, щойно хтось із союзників підберає їх.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-experience' id="experience">
                <div className='basics_text-experience' >
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Досвід</h2>
                    </div>
                    <div>
                        <p>
                            Довід (очки досвіду, ОД) отримується, якщо ви перебуваєте біля ворога чи нейтральних істот, коли
                            вони помирають. Це не залежить відтого, хто завдав останній удар.
                        </p>
                        <p>
                            Також досвід дається за вбивство ворожих героїв. Чим більший рівень героя, тим більше досвіду ви
                            отримаєте за його вбивство.
                        </p>
                        <p>
                            Застави поступово дають досвід команді, яка їх контролює.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-lastHitsAndDenying' id="lastHitsAndDenying">
                <div className='basics_text-lastHitsAndDenying'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Останні удари та добивання</h2>
                    </div>
                    <div>
                        <p>
                            Коли атака чи здібність добиває ворожу істоту - це зається останній удар. Гравець, що контролює
                            істоту, яка добила, отримує винагороду золотом.
                        </p>
                        <p>
                            Загальна кількість останніх ударів у грі, завдана гравцем (часто використовується для приблизного
                            підрахунку отриманого золота), скорочено позначається як ОУ або «Ка-Ес» (від англ. СS, Creep
                            Sсоrе).
                        </p>
                        <p>
                            Коли рівень здоров'я дружньої істоти падає нижче ніж 50%, то союзні герої можуть її вбити. Це
                            зветься «добиванням». Воно зменшує кількість досвіду, який отримують ворожі герої.
                        </p>
                        <p>
                            Союзні вежі можна добити, якщо вони мають менше 10% здоров'я.
                        </p>
                        <p>
                            Союзних героїв можна добивати лише тоді, коли вони перебувають піддією періодичної шкоди.
                            Також деякі герої можуть добити самі себе за допомогою здібностей, які завдають шкоду собі.
                            Добивання героїв не дає ворогам отримати золото й досвід, але загиблий герой усе одно втрачає
                            золото.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-damage' id="damage">
                <div className='table-damage'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Шкода</h2>
                    </div>
                    <div>
                        <div className='damage'>
                            <h4>Базові атаки</h4>
                            <p className='table-damage-p'>Усі ітоти можуть завдавати шкоду за допомогою базових атак (що іноді звуться автоатаками), якщо
                                клацнути правою кнопкою миші на ворожій істоті. Ці.
                                атаки завдають фізичної шкоди й зазвичай на них не
                                витрачаються ресурси (як-от мана).
                            </p>
                        </div>
                        <div className='damage'>
                            <h4>Здібності</h4>
                            <p className='table-damage-p'>інший основний спосіб завдавання шкоди - - це
                                істоти, Зазвичай здібності можуть завдавати
                                значно більше шкоди, ніж базові атаки, але на них
                                витрачаються деякі ресурси. Окрім того, їх можна
                                застосувати лише з певним інтервалом.
                            </p>
                        </div>
                        <div className='damage'>
                            <h4>Броня</h4>
                            <p className='table-damage-p'>Броня (іноді зветься фізичним опором) зменшує
                                кількість отриманої істотою фізичної шкоди. Що більше
                                значення броні, то сильніше зменшується отримана
                                фізична шкода. Кожен герой має базове значення бро
                                яке можна безпосередньо збільшити за допомогою
                                предметів чи талантів, або ж опосередковано шляхом
                                збільшення спритності героя. Здібності та ефекти
                                можуть зменшувати значення броні героя аж до
                                негативногочисла, тобто він отримуватиме збільшену шкоду від фізичних атак.</p>
                        </div>
                        <div className='damage'>
                            <h4>Опір магії</h4>
                            <p className='table-damage-p'>Магічний опір - це відсоткове значення, що зменшує
                                отриману істотою магічну шкоду. Герої мають стандартний опір магії 25%.</p>
                        </div>
                        <div className='damage'>
                            <h4>Фізична шкода</h4>
                            <p className='table-damage-p'>Основним джерелом фізичних атак є базові атаки, хоча
                                деякі здібності також завдають фізичної шкоди. Зменшити кількість отримуваної героєм фізичної школи
                                можна за допомогою броні</p>
                        </div>
                        <div className='damage'>
                            <h4>Магічна шкода</h4>
                            <p className='table-damage-p'>Основним джерелом магічної шкоди є активні здібності
                                героїв, істот і предметів. Магічну шкоду зменшує опір до магії істоти
                            </p>
                        </div>
                        <div className='damage'>
                            <h4>Абсолютна шкода</h4>
                            <p className='table-damage-p'>Невелика килькість здібностей завдає абсолютної шкоди безпосередньо істоті й не зважає на броню та опір магії</p>
                        </div>
                    </div>
                </div>
            </div>
            <div>
                <div className='section-death' id="death">
                    <div className='basics_text-death'>
                        <div className='basics_text-death'>
                            <label>МЕХАНІКА</label>
                            <h2>Смерть</h2>
                        </div>
                        <div>
                            <p>Коли ваш герой помирає, то вам доведеться чекати певний час до його повернення в бій.Час відродження залежить від рівня вашого героя. Смерть є вартою цінного часу, бо до відродження ви не вбивати(фармити) крипів чи допомогати своїм союзникам</p>
                            <p>Додатково після смерті гравці витрачають 1/40 частку свого поточного невитраченого золота. Надійне золото, тобто золото, отримано с пасивного прибутку чи активації рун достатку, не можна витратити.</p>
                            <p>Гравці мають можливість обійти часочікування на видродження і, заплативши золото, за допомогою кнопки викупу відродитися негайно. Вартість викупу пропорційна загальній вартості предметів, якими володіе ваш герой. Викуп має зарядку 8 хв. Також у разі першої смерті після викупу ви отримаєте додаткові 25с до часу відродження.</p>
                        </div>
                    </div>
                </div>
            </div>
            <div className='section-atribut'  id="unitStats">
                <div className='basics_text-atribut'>
                    <div className='title-atribut'>
                        <label>МЕХАНІКА</label>
                        <h2>Характеристика істот</h2>
                    </div>
                    <div className='atribut'>
                        <div className='mana-health'>
                            <h3>Здоров'я і мана</h3>
                            <div>
                                <p>Здоров'я визначає кількість шкоди, яку може отримати герой, перш ниж померти. Кожен пункт сили збільшуе максимальне здоров'я героя та регенерацію.</p>
                                <p>Мана визначає, як багато здібностей може використати герой. Кожен пункт інтелекту збільшуе максимальний рівень мани героя і регенерацію мани.</p>
                            </div>
                        </div>
                        <div className='table-atribut'>
                            <h3>Характеристики</h3>
                            <div className='table'>
                                <h4>Сила</h4>
                                <p>Одиниця сили дає 22 здоров'я та 0.09 регенерації здоров'я.</p>
                            </div>
                            <div className='table'>
                                <h4>Спритність</h4>
                                <p>Кожен пункт спритності дає одне очко до швидкості атаки й 0.14 броні.</p>
                            </div>
                            <div className='table'>
                                <h4>Інтелект</h4>
                                <p>Одиниця інтелекту дає 12 мани, 0.05 регенерації мани та 0.1% опору до магії</p>
                            </div>
                        </div>
                        <div className='table-mobile'>
                            <h3>Рухливість</h3>
                            <div className='table'>
                                <h4>Швидкість руху</h4>
                                <p>Швидкість, із якою герой рухається по мапі.</p>
                            </div>
                            <div className='table'>
                                <h4>Швидкість повороту</h4>
                                <p>Швидкість, із якою герой обертається на мисці.</p>
                            </div>
                            <div className='table'>
                                <h4>Радіус огляду</h4>
                                <p>Відстань, на яку герой може бачити на відкритій місцевості (значення зазвичай різниться вдень і вночі).</p>
                            </div>
                        </div>
                        <div className='table-attacks'>
                            <h3>Атака</h3>
                            <div className='table'>
                                <h4>Шкода</h4>
                                <p>Кількість шкоди, яку спричіняє герой за атаку.</p>
                            </div>
                            <div className='table'>
                                <h4>Швидкість атаки</h4>
                                <p>Більша швидкість атаки - коротша затримка між атаками.</p>
                            </div>
                            <div className='table'>
                                <h4>Базовий час атаки</h4>
                                <p>Час між атаками до застосування додаткової швидкості атаки героя.</p>
                            </div>
                            <div className='table'>
                                <h4>Дальність атаки</h4>
                                <p>Відстань, із якої герой може атакувати </p>
                            </div>
                            <div className='table'>
                                <h4>Швидкість снаряда</h4>
                                <p>Швидкість руху снаряда атаки в героїв дальнього бою</p>
                            </div>
                        </div>
                        <div className='table-protection'>
                            <h3>Захист</h3>
                            <div className='table'>
                                <h4>Броня</h4>
                                <p>Броня визначаеться скільки блокуватиметься шкоди від фізичніх атак.</p>
                            </div>
                            <div className='table'>
                                <h4>Опір магії</h4>
                                <p>Опір магії визначає скільки шкоди герой заблокує від магічних атак.</p>
                            </div>
                            <div className='table'>
                                <h4>Опір ефектам</h4>
                                <p>Опір ефектам зменшує тривалість негативних ефектів статусу, як-от приголомшення чи знемовлення.</p>
                            </div>
                            <div className='table'>
                                <h4>Ухилення</h4>
                                <p>Ухилення - відсотковий шанс того, що атака по герою схибить.</p>
                            </div>
                            <div className='table'>
                                <h4>Блокування шкоди</h4>
                                <p>Герої ближнього бою (але не дальнього бою) мають 50% шансу заблокувати 16 шкоди від усих базових атак.</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <div className='section-spells' id="abilities">
                <div className='basics-table-spells'>
                    <div>
                        <div className='title-spells'>
                            <label>МЕХАНІКА</label>
                            <h2>Здібності</h2>
                        </div>
                        <div className='table'>
                            <h4>Активна</h4>
                            <p>Більшість здібностей істотє активними, і їх вручну застосовує гравець або ШІ. Більшість здібностей (але не всі) потребують витрати мани для застосування і мають час зарядки до можливості наступного використання.</p>
                        </div>
                        <div className='table'>
                            <h4>Пасивна</h4>
                            <p>Пасивні здібності не потребують жодних дій гравця. Зазвичай пони змінюють якісь із характерістик істот або викликають спрацювання ефектів, коли дасягаються певні умови.</p>
                        </div>
                        <div className='table'>
                            <h4>Зарядка</h4>
                            <p>Майже всі активні (і деякі пасивні) здібності мають зарядку в секундах. Після використання здібність неактивна до завершення часу зарядки.</p>
                        </div>
                        <div className='table'>
                            <h4>Чаклування</h4>
                            <p>Чаклувальні здібності - це активні здібності, під час чаклування яких істота не повинна виконувати жодних інших дій. Одні чаклувальні здібности почінають діяти після завершення чаклування, а інші натомість діють упродовж періоду чаклування. Ці здібності можна перервати приголомшенням, страхом або знемовленням.</p>
                        </div>
                        <div className='table'>
                            <h4>Аури</h4>
                            <p>Аури - це пассивні здібності, що застосовують постійний ефект на істот у зоні дії навколо джерела аури. Аури діють і на невидимих істот.</p>
                        </div>
                    </div>
                </div>
            </div>
            <div className='section-status_effects' id="statusEffects">
                <div className='basics-table-status_effects'>
                    <div>
                        <div className='title-spells'>
                            <label>МЕХАНІКА</label>
                            <h2>Ефекти статусу</h2>
                        </div>
                        <div className='table'>
                            <h4>Приголомшення</h4>
                            <p>У приголомшенні істоти перериваються всі її дії, а також вона не може рухатися чи здійснювати інші дії впродовж ефекту приголомшення.</p>
                        </div>
                        <div className='table'>
                            <h4>Укорінення</h4>
                            <p>У вкоріненої істоти переривається багато дій (наприклад, телепортування). Укорінена істота не може рухатися й не може використовувати більшість здібностей, які пов'язані з рухом.</p>
                        </div>
                        <div className='table'>
                            <h4>Знемовлення</h4>
                            <p>Знемовленна істота не може використовувати свої здібності, але може використовувати предмети.</p>
                        </div>
                        <div className='table'>
                            <h4>Приглушити</h4>
                            <p>Приглушена істота не може використовувати предмети, але може використовувати здібності.</p>
                        </div>
                        <div className='table'>
                            <h4>Переривання</h4>
                            <p>Переривання вимикає в істоти дію всих її пасивних здібностей.</p>
                        </div>
                        <div className='table'>
                            <h4>Роззброєння</h4>
                            <p>Роззброєна істота не може атакувати.</p>
                        </div>
                        <div className='table'>
                            <h4>Страх</h4>
                            <p>У істоти під дією страху перериваються всі її дії, вона не може здійснювати нових дій і змушена рухатися в певному напрямку (в більшості випадків у напрямку свого Древнього).</p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
}
export default Mechanics;
