import React from "react";
import '../../styles/mechanics.css'

const Mechanics = () => {
    return (
        <section className='mechanics'>
            <div className='section-LVL'>
                <div className='basics_text-LVL'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>РІВЕНЬ ІСТОТИ</h2>
                    </div>
                    <div>
                        <p>
                            Герої починають гру з першим рівнем та підвищують його, отримуючи досвідза вбивство кріпів чи
                            героїв. Максимальний рівень - 30. Рівень найпростіший показник того, що один герой сильніший
                            іншого.
                        </p>
                        <p>
                            Кожен рівень дає вам очки здібностей, які можна витратити на нову здібність, покращити вже
                            вивчену чи підвищити характеристики героя. Після досягнення 10-го рівня ви також можете вивчати
                            таланти.
                        </p>
                        <p>
                            Сила, інтелект і спритність героя також зростають із кожним його рівнем. Деякі герої мають більший
                            приріст характеристик, ніж інші, що робить їх сильнішими на пізніх стадіях гри.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-GoldBountie'>
                <div className='basics_text-GoldBountie'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Золото й винагороди</h2>
                    </div>
                    <div>
                        <p>
                            Ви отримуєте золото, коли задаете вбивчого удару кріпу.
                        </p>
                        <p>
                            Ви також пассивно отримуєте золото протягом усього часу гри.
                        </p>
                        <p>
                            Винагарода золотом отримується за вбивство ворожих героїв чи за підтримку вашим союзникам у вбивстві.
                        </p>
                        <p>
                            Вороги, які сдійснили серію вбивств (певну кількість убивств без власної загибелі), дають додаткову винагороду золотом, пропорційну до серії вбивств.
                        </p>
                        <p>
                            Руни достатку відроджуються щотрихвилини в кожному лісі й винагороджують усю команду, щойно хтось із союзників підберає їх.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-experience'>
                <div className='basics_text-experience'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Досвід</h2>
                    </div>
                    <div>
                        <p>
                            Довід (очки досвіду, ОД) отримується, якщо ви перебуваєте біля ворога чи нейтральних істот, коли
                            вони помирають. Це не залежить відтого, хто завдав останній удар.
                        </p>
                        <p>
                            Також досвід дається за вбивство ворожих героїв. Чим більший рівень героя, тим більше досвіду ви
                            отримаєте за його вбивство.
                        </p>
                        <p>
                            Застави поступово дають досвід команді, яка їх контролює.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-lastHitsAndDenying'>
                <div className='basics_text-lastHitsAndDenying'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Останні удари та добивання</h2>
                    </div>
                    <div>
                        <p>
                            Коли атака чи здібність добиває ворожу істоту - це зається останній удар. Гравець, що контролює
                            істоту, яка добила, отримує винагороду золотом.
                        </p>
                        <p>
                            Загальна кількість останніх ударів у грі, завдана гравцем (часто використовується для приблизного
                            підрахунку отриманого золота), скорочено позначається як ОУ або «Ка-Ес» (від англ. СS, Creep
                            Sсоrе).
                        </p>
                        <p>
                            Коли рівень здоров'я дружньої істоти падає нижче ніж 50%, то союзні герої можуть її вбити. Це
                            зветься «добиванням». Воно зменшує кількість досвіду, який отримують ворожі герої.
                        </p>
                        <p>
                            Союзні вежі можна добити, якщо вони мають менше 10% здоров'я.
                        </p>
                        <p>
                            Союзних героїв можна добивати лише тоді, коли вони перебувають піддією періодичної шкоди.
                            Також деякі герої можуть добити самі себе за допомогою здібностей, які завдають шкоду собі.
                            Добивання героїв не дає ворогам отримати золото й досвід, але загиблий герой усе одно втрачає
                            золото.
                        </p>
                    </div>
                </div>
            </div>
            <div className='section-damage'>
                <div className='table-damage'>
                    <div>
                        <label>МЕХАНІКА</label>
                        <h2>Шкода</h2>
                    </div>
                    <div>
                        <div className='damage'>
                            <h3>Базові атаки</h3>
                            <p className='table-damage-p'>Усі ітоти можуть завдавати шкоду за допомогою базових атак (що іноді звуться автоатаками), якщо
                                клацнути правою кнопкою миші на ворожій істоті. Ці.
                                атаки завдають фізичної шкоди й зазвичай на них не
                                витрачаються ресурси (як-от мана).
                            </p>
                        </div>
                        <div className='damage'>
                            <h3>Здібності</h3>
                            <p className='table-damage-p'>інший основний спосіб завдавання шкоди - - це
                                істоти, Зазвичай здібності можуть завдавати
                                значно більше шкоди, ніж базові атаки, але на них
                                витрачаються деякі ресурси. Окрім того, їх можна
                                застосувати лише з певним інтервалом.
                            </p>
                        </div>
                        <div className='damage'>
                            <h3>Броня</h3>
                            <p className='table-damage-p'>Броня (іноді зветься фізичним опором) зменшує
                                кількість отриманої істотою фізичної шкоди. Що більше
                                значення броні, то сильніше зменшується отримана
                                фізична шкода. Кожен герой має базове значення бро
                                яке можна безпосередньо збільшити за допомогою
                                предметів чи талантів, або ж опосередковано шляхом
                                збільшення спритності героя. Здібності та ефекти
                                можуть зменшувати значення броні героя аж до
                                негативногочисла, тобто він отримуватиме збільшену шкоду від фізичних атак.</p>
                        </div>
                        <div className='damage'>
                            <h3>Опір магії</h3>
                            <p className='table-damage-p'>Магічний опір - це відсоткове значення, що зменшує
                                отриману істотою магічну шкоду. Герої мають стандартний опір магії 25%.</p>
                        </div>
                        <div className='damage'>
                            <h3>Фізична шкода</h3>
                            <p className='table-damage-p'>Основним джерелом фізичних атак є базові атаки, хоча
                                деякі здібності також завдають фізичної шкоди. Зменшити кількість отримуваної героєм фізичної школи
                                можна за допомогою броні</p>
                        </div>
                        <div className='damage'>
                            <h3>Магічна шкода</h3>
                            <p className='table-damage-p'>Основним джерелом магічної шкоди є активні здібності
                                героїв, істот і предметів. Магічну шкоду зменшує опір до магії істоти
                            </p>
                        </div>
                        <div className='damage'>
                            <h3>Абсолютна шкода</h3>
                            <p className='table-damage-p'>Невелика килькість здібностей завдає абсолютної шкоди безпосередньо істоті й не зважає на броню та опір магії</p>
                        </div>
                    </div>
                </div>
            </div>
            <div>
                <div className='section-death'>
                    <div className='basics_text-death'>
                        <div className='basics_text-death'>
                            <label>МЕХАНІКА</label>
                            <h2>Смерть</h2>
                        </div>
                        <div>
                            <p>Коли ваш герой помирає, то вам доведеться чекати певний час до його повернення в бій.Час відродження залежить від рівня вашого героя. Смерть є вартою цінного часу, бо до відродження ви не вбивати(фармити) крипів чи допомогати своїм союзникам</p>
                            <p>Додатково після смерті гравці витрачають 1/40 частку свого поточного невитраченого золота. Надійне золото, тобто золото, отримано с пасивного прибутку чи активації рун достатку, не можна витратити.</p>
                            <p>Гравці мають можливість обійти часочікування на видродження і, заплативши золото, за допомогою кнопки викупу відродитися негайно. Вартість викупу пропорційна загальній вартості предметів, якими володіе ваш герой. Викуп має зарядку 8 хв. Також у разі першої смерті після викупу ви отримаєте додаткові 25с до часу відродження.</p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
}
export default Mechanics;
